<?php
$basePath = dirname(__DIR__);

$json = json_decode(file_get_contents($basePath . '/raw/map.json'), true);

$pool = [
    '宜蘭縣天主教靈醫會醫療財團法人羅東聖母醫院' => [121.771529, 24.671923], //1134020028
    '臺北市國立台灣大學醫學院附設醫院國立臺灣大學醫學院附設醫院兒童醫院' => [121.51875, 25.044344], //0401180023
    '臺北市台灣基督長老教會馬偕醫療財團法人馬偕紀念醫院台灣基督長老教會馬偕醫療財團法人馬偕兒童醫院' => [121.52256, 25.058884], //1101100020
    '臺北市臺北市立萬芳醫院-委託臺北醫學大學辦理' => [121.55833, 25.000305], //1301200010
    '臺北市臺北市立聯合醫院仁愛院區' => [121.545224, 25.037128], //0101090517
    '臺北市臺北市立聯合醫院陽明院區' => [121.531481, 25.105257], //0101090517
    '臺北市臺北市立聯合醫院和平婦幼院區' => [121.519004, 25.028952], //0101090517
    '臺北市臺北市立聯合醫院中興院區' => [121.509221, 25.050763], //0101090517
    '臺北市臺北市立聯合醫院忠孝院區' => [121.586178, 25.046472], //0101090517
    '新北市衛生福利部雙和醫院(委託臺北醫學大學興建經營)' => [121.49408, 24.993746], //1331040513
    '新北市新北市立土城醫院(委託長庚醫療財團法人興建經營)' => [121.44873, 24.976437], //1131130018
    '新北市新北市立聯合醫院三重院區' => [121.490666, 25.061105], //0131020016
    '新北市新北市立聯合醫院板橋院區' => [121.457411, 25.023346], //0131020016
    '新北市天主教耕莘醫療財團法人耕莘醫院安康院區' => [121.503968, 24.954070], //1231050017
    '新竹市台灣基督長老教會馬偕醫療財團法人新竹馬偕紀念醫院新竹市立馬偕兒童醫院(委託台灣基督長老教會馬偕醫療財團法人興建經營)' => [121.00293, 24.79716], //1112010537
    '新竹縣國立臺灣大學醫學院附設醫院新竹臺大分院生醫醫院竹北院區' => [121.043587, 24.805803], //0433050018
    '新竹縣國立臺灣大學醫學院附設醫院新竹臺大分院生醫醫院竹東院區' => [121.093283, 24.719285], //0433050018
    '臺中市光田醫療社團法人光田綜合醫院沙鹿總院' => [120.55886, 24.235394], //0936050029
    '臺中市光田醫療社團法人光田綜合醫院大甲院區' => [120.616986, 24.346467], //0936050029
    '臺中市中國醫藥大學附設醫院中國醫藥大學兒童醫院' => [120.6809, 24.157219], //1303260014
    '彰化縣秀傳醫療社團法人秀傳紀念醫院彰化基督教醫療財團法人彰化基督教醫院' => [120.544464, 24.07149], //1137010024
    '彰化縣員榮醫療社團法人員榮醫院員生院區' => [120.566476, 23.959284], //0937050014
    '雲林縣國立臺灣大學醫學院附設醫院雲林分院虎尾院區' => [120.426912, 23.735430], //0439010518
    '高雄市高雄市立小港醫院(委託財團法人私立高雄醫學大學經營)' => [120.36337, 22.567467], //1102110011
    '高雄市高雄市立大同醫院' => [120.297171, 22.626950], //0107340027
    '高雄市高雄市立岡山醫院(委託秀傳醫療社團法人經營)' => [120.29444, 22.796612], //0942020019
    '高雄市高雄醫學大學附設高醫岡山醫院' => [120.30135, 22.779121], //1307020025
    '高雄市高雄市立鳳山醫院(委託長庚醫療財團法人經營)' => [120.36308, 22.628565], //1142010518
    '高雄市國軍左營總醫院岡山分院附設民眾診療服務處' => [120.29223, 22.700352], //0502030015
    '高雄市高雄市立旗津醫院(委託財團法人私立高雄醫學大學經營)' => [120.28511, 22.590208], //1307370011
    '屏東縣安泰醫療社團法人安泰醫院' => [120.547615, 22.55477], //0943020013
];
foreach ($json['mapdata'] as $item) {
    $city = mb_substr($item['hosp_addr'], 0, 3, 'utf-8');
    $key = $city . $item['hosp_name'];
    $pool[$key] = [$item['wgs_lon'], $item['wgs_lat']];
}
/**
 * the list coming from https://dep.mohw.gov.tw/DOMA/cp-2710-7581-106.html (首頁 -> 重點項目 -> 緊急醫療 -> 急救責任醫院名單)
 */
$fh = fopen($basePath . '/raw/pdf/急救責任醫院名單1140109.csv', 'r');
$header = fgetcsv($fh);
$fc = [
    'type' => 'FeatureCollection',
    'features' => [],
];
while ($line = fgetcsv($fh)) {
    $data = array_combine($header, $line);
    $key = $data['縣市別'] . $data['醫院全名'];
    $lngLat = $pool[$key];
    $level = mb_substr($data['緊急醫療能力分級'], 0, 2, 'utf-8');
    if($level === '重度') {
        continue;
    }
    $data['level'] = $level;
    $f = [
        'type' => 'Feature',
        'properties' => $data,
        'geometry' => [
            'type' => 'Point',
            'coordinates' => $lngLat,
        ],
    ];
    $fc['features'][] = $f;
}

file_put_contents($basePath . '/docs/geojson/er_extra.json', json_encode($fc, JSON_UNESCAPED_UNICODE | JSON_PRETTY_PRINT));